<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a802246fd26832816bf2cb0594a87146bb457cc10ffa9ecf00da97d8db1877ba","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1350 at https://github.com/cal-itp/data-infra/actions/runs/20973448104","plan_out_hash":"8dba0ed72ae2d81db9da8a341b4bd8afb66e3ac6b6ba9fbefe8af6da63e4c0ee","plan_hash":"85168175057a2c90a3c5f506dcd8b9304b2c0fd9e69244cca1a0c34c9e276148","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "E+JEkw==" -> (known after apply)
!~      detect_md5hash      = "mEN2CDs1SXAg1buCzBy08Q==" -> "different hash"
!~      generation          = 1768335727325315 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "mEN2CDs1SXAg1buCzBy08Q==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/dim_stop_arrivals.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "TwvSgw==" -> (known after apply)
!~      detect_md5hash      = "32iiueYjkLs4sm4MjqGcVQ==" -> "different hash"
!~      generation          = 1767986272100989 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/dim_stop_arrivals.sql"
!~      md5hash             = "32iiueYjkLs4sm4MjqGcVQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/dim_stop_arrivals.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_scheduled_stops.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "hA4ZpQ==" -> (known after apply)
!~      detect_md5hash      = "cKNseZ4EHgkLT2YfVngOlg==" -> "different hash"
!~      generation          = 1764958876209932 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_daily_scheduled_stops.sql"
!~      md5hash             = "cKNseZ4EHgkLT2YfVngOlg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_scheduled_stops.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "cdSUcw==" -> (known after apply)
!~      detect_md5hash      = "KLv+acfNQDM19KT5Pkxk4A==" -> "different hash"
!~      generation          = 1768335729056619 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "KLv+acfNQDM19KT5Pkxk4A==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1350](https://github.com/cal-itp/data-infra/actions/runs/20973448104)